import streamlit as st
import sys
import os
import c_data_service as ds
import c_ui as ui
sys.path.append(os.path.abspath(os.path.join(os.path.dirname(__file__), '..')))


st.set_page_config(layout="wide", page_title="交通政策影響分析", page_icon="⚖️")

def main():
    df_market = ds.get_all_nightmarkets()
    ui.render_sidebar(df_market)
    st.title("⚖️ 禮讓行人政策成效分析")
    with st.expander("📝 專案願景：從小民到政策，為何我們必須改變？", expanded=True):
        st.markdown("""
        #### 👴 高齡危機來襲
        臺灣人口加速老化，高齡駕駛與行人激增，行動遲緩、判斷力衰退，上路風險飆升——**你我終將老去，豈能坐視不管？**
        
        #### 🛡️ 從數據驅動改變
        我們希望從夜市周邊逆轉惡名，提升在地安全、化解遊客疑慮，進而影響政策。
        透過數據驗證政策成效，讓**人人參與**，期許臺灣交通不再是「地獄」，而是驕傲的「好行」！
        """)
    st.markdown("針對 **2023 年 6 月 30 日** 起實施的《道路交通管理處罰條例》修正案，整合全台區域分佈與個別夜市趨勢。")
    st.markdown("---")

if __name__ == "__main__":
    main()